socialNetwork/wrk2/test-run/COMMAND_24/70
Running 1m test @ http://localhost:31111/wrk2-api/post/compose
  8 threads and 16 connections
  Thread calibration: mean lat.: 7.771ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 8.133ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 8.426ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 8.330ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 7.001ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 8.740ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 8.642ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 8.069ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     9.76ms   11.70ms  72.57ms   94.17%
    Req/Sec   128.52     44.39   250.00     77.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.09ms
 75.000%    8.10ms
 90.000%   10.32ms
 99.000%   72.57ms
 99.900%  120.13ms
 99.990%  152.32ms
 99.999%  164.22ms
100.000%  164.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.605     0.000000            1         1.00
       5.739     0.100000         5005         1.11
       6.179     0.200000        10038         1.25
       6.503     0.300000        15007         1.43
       6.799     0.400000        20001         1.67
       7.095     0.500000        25003         2.00
       7.251     0.550000        27519         2.22
       7.431     0.600000        30052         2.50
       7.623     0.650000        32528         2.86
       7.839     0.700000        35007         3.33
       8.099     0.750000        37522         4.00
       8.263     0.775000        38765         4.44
       8.455     0.800000        40018         5.00
       8.687     0.825000        41275         5.71
       8.975     0.850000        42507         6.67
       9.439     0.875000        43756         8.00
       9.767     0.887500        44379         8.89
      10.319     0.900000        44999        10.00
      11.375     0.912500        45623        11.43
      13.959     0.925000        46247        13.33
      19.167     0.937500        46872        16.00
      22.655     0.943750        47184        17.78
      26.143     0.950000        47499        20.00
      29.951     0.956250        47809        22.86
      33.983     0.962500        48122        26.67
      38.719     0.968750        48434        32.00
      40.831     0.971875        48590        35.56
      43.487     0.975000        48748        40.00
      47.071     0.978125        48903        45.71
      51.295     0.981250        49059        53.33
      56.959     0.984375        49215        64.00
      60.415     0.985938        49293        71.11
      64.927     0.987500        49372        80.00
      69.119     0.989062        49450        91.43
      74.815     0.990625        49530       106.67
      80.703     0.992188        49609       128.00
      84.159     0.992969        49645       142.22
      87.551     0.993750        49685       160.00
      90.559     0.994531        49723       182.86
      94.079     0.995313        49762       213.33
      98.623     0.996094        49802       256.00
     101.055     0.996484        49821       284.44
     103.039     0.996875        49841       320.00
     105.983     0.997266        49861       365.71
     108.543     0.997656        49879       426.67
     112.511     0.998047        49899       512.00
     114.943     0.998242        49909       568.89
     116.479     0.998437        49918       640.00
     117.375     0.998633        49928       731.43
     119.167     0.998828        49938       853.33
     121.727     0.999023        49948      1024.00
     123.583     0.999121        49953      1137.78
     124.415     0.999219        49957      1280.00
     126.335     0.999316        49962      1462.86
     130.687     0.999414        49967      1706.67
     132.607     0.999512        49972      2048.00
     136.063     0.999561        49975      2275.56
     138.111     0.999609        49977      2560.00
     139.007     0.999658        49979      2925.71
     142.079     0.999707        49982      3413.33
     144.127     0.999756        49984      4096.00
     144.639     0.999780        49986      4551.11
     144.895     0.999805        49987      5120.00
     146.175     0.999829        49988      5851.43
     149.247     0.999854        49989      6826.67
     149.887     0.999878        49990      8192.00
     152.319     0.999890        49992      9102.22
     152.319     0.999902        49992     10240.00
     152.319     0.999915        49992     11702.86
     152.959     0.999927        49993     13653.33
     152.959     0.999939        49993     16384.00
     155.391     0.999945        49994     18204.44
     155.391     0.999951        49994     20480.00
     155.391     0.999957        49994     23405.71
     158.079     0.999963        49995     27306.67
     158.079     0.999969        49995     32768.00
     158.079     0.999973        49995     36408.89
     158.079     0.999976        49995     40960.00
     158.079     0.999979        49995     46811.43
     164.223     0.999982        49996     54613.33
     164.223     1.000000        49996          inf
#[Mean    =        9.761, StdDeviation   =       11.705]
#[Max     =      164.096, Total count    =        49996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59859 requests in 1.00m, 12.27MB read
Requests/sec:    997.57
Transfer/sec:    209.45KB